blog/2025/05/installing-guix/index.org
#+TITLE: Installing Guix (Full LUKS + LVM)
#+DESCRIPTION: Installation Notes and Catches for installing a fully encrypted Guix include /boot on LUKS + LVM.
#+TAGS: Guix
#+TAGS: GNU/Linux
#+TAGS: Notes
#+TAGS: Fully Encrypted System
#+TAGS: LUKS
#+TAGS: LVM
#+DATE: 2025-05-26
#+SLUG: installing-guix
#+LINK: guix https://guix.gnu.org/
#+LINK: grub https://www.gnu.org/software/grub
#+LINK: dotfiles https://git.sr.ht/~kennyballou/dotfiles.git
#+LINK: fedora https://fedoraproject.org/
#+LINK: badblocks https://en.wikipedia.org/wiki/Badblocks

#+BEGIN_PREVIEW
Here are some notes about installing Guix SD onto a new system from an existing
configuration.  We necessarily need to discuss disk preparation and
partitioning.  Additionally, we discuss from the perspective of existing
configurations.  I planned to write this back in 2022, after initially
switching from NixOS to Guix.  I hesitated at the time since such a post would
not have any additional value to people otherwise installing Guix.  However,
going through the process again, I feel there are some comments to capture that
may be beneficial to others venturing down this path.  I will save the
discussion between NixOS and Guix for another time.  For now, let's settle on
"scheme is more better."
#+END_PREVIEW

After having a corrupted [[grub][GRUB]] kill my previous [[guix][Guix System]], and a false sense
of urgency, I have been running, begrudgingly, [[fedora][Fedora Workstation]] for the last
10 months.  However, with summer here, I am eager to return to using [[guix][Guix]] as my
primary OS.

[[fedora][Fedora]] has been fine.  It seems to work for the most part.  But there just
seems to be this constant encroaching entropy causing the system to become less
and less stable.  Using [[guix][Guix]] as a package manager seemed to work fine in the
beginning, but over time, it has started showing some degradation that is
simply unworkable.  If I must scorch earth reinstall, I might as well install
using my preferred OS and existing [[dotfiles][system configuration]].  However, in my
attempts to switch back to [[guix][Guix]], I have uncovered some sharp edges, because of
course.

** Disk preparation steps
:PROPERTIES:
:ID:       b53066c9-07aa-41d4-9944-ede3d1e19dc7
:END:

First step to any fully encrypted setup is to throw a bunch of random bits onto
the disk, the zeroth step is to check it with ~badblocks~.  Next, randomize the
data on the disk to protect against easy statistical analysis.  Afterwards, we
partition the drive into two primary physical partitions.  Then, we create the
LUKS container and the LVM volumes.  Finally, we format all the different
volumes and mount them in preparation for =system init=.

*** Badblocks
:PROPERTIES:
:ID:       dcd8a075-847d-40ab-9f1f-ab7d7e6eac5a
:END:

Since I still needed a working machine in the meantime, I purchased a second
drive.  This way, if the installation fails for any reason--- it did--- I can
switch back to a working "machine".  But to be sure the new drive is in good
working order, I tested it with [[badblocks][badblocks]]:

#+begin_src bash :eval never
badblocks -wsv -t 0xEF ${device}
badblocks -wsv -t 0XFE ${device}
#+end_src

This does two read-write, read *DESTRUCTIVE*, passes on the new device, checking
for any errors.

Now for some, this is "enough" random scrubbing of the disk in preparation for
an encrypted volume.  However, I disagree.  If the entire disk is a giant
pattern of "0xFE" values, your /actual/ data shines like a bright hot star for
statistical analysis of the data.

*** Random "zeroing"
:PROPERTIES:
:ID:       df34dd5b-7369-49e3-9aed-2c84c8b54688
:END:

The fastest (not to be confused with "best") way I have seen to randomly write
garbage to a drive is to use a plain ~dm-crypt~ device with a random passphrase
and write zeros to the resulting container.

#+begin_src bash :eval never
cryptsetup open --type plain --key-file=/dev/urandom ${device} wipe-me
dd if=/dev/zero of=/dev/mapper/wipe-me bs=4096 status=progress
cryptsetup close
#+end_src

Also, critical for the throughput of the above command, setting the "blocksize"
via ~bs=4096~ dramatically improves the write speed.

*** Partitioning
:PROPERTIES:
:ID:       081d058d-e7d3-4029-9036-21ef69a207ea
:END:

Since the system uses a single device and we have a "fully encrypted" setup, we
only need *two* partitions: first for the EFI System Partition (ESP) and second
for the LUKS container.

I created this using the interactive prompts within ~gptdisk~.  Creating the
first partition to be 128M at the default starting sector (2048), and the
second taking the rest of the sectors.  I denoted their partition types using
the codes ~EF00~, and ~8308~, respectively.  Finally, I renamed them to something
more meaningful to me: "boot" and "guix", respectively.

