blog/2025/05/installing-guix/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-26 Mon 23:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Installing Guix (Full LUKS + LVM)</title>
<meta name="author" content="kb" />
<meta name="description" content="Installation Notes and Catches for installing a fully encrypted Guix include /boot on LUKS + LVM." />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/">
    <i class="fade fas fa-home"></i>
  </a>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.sr.ht/~kennyballou/"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade far fa-circle fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://orcid.org/0000-0002-6032-474X"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-orcid"></i>
  </a>
  <a href="https://linkedin.com/in/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-linkedin-in fa-1x"></i>
  </a>
  <a href="/support.html">
    <i class="fade fas fa-heart fa-1x"></i>
  </a>
  <a href="/cv.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/B74CC4B41148C3DB364BC21182D94B35744E1B34.asc"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main" class="content">
<h1 class="title">Installing Guix (Full LUKS + LVM)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org03f348e">Disk preparation steps</a>
<ul>
<li><a href="#org6277368">Badblocks</a></li>
<li><a href="#org2dc6dfe">Random "zeroing"</a></li>
<li><a href="#orge3ee9f0">Partitioning</a></li>
<li><a href="#org394f035">Creating LUKS container</a>
<ul>
<li><a href="#org68698df">"Correctly" naming the cryptroot</a></li>
</ul>
</li>
<li><a href="#orgb3ed092">Creating the LVM containers</a></li>
<li><a href="#orgbd31885">Formatting</a></li>
<li><a href="#orgee857e0">Mounting</a>
<ul>
<li><a href="#orgb14e20e">Nix Store</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org231991a">Cloning and modifying UUIDs</a></li>
<li><a href="#org1cefb82">System initialization</a></li>
<li><a href="#org1561ee7">After initialization steps</a></li>
<li><a href="#orgcfe4a82">Parting thoughts</a></li>
</ul>
</div>
</div>
<div class="PREVIEW" id="org48dbd3a">
<p>
Here are some notes about installing Guix SD onto a new system from an existing
configuration.  We necessarily need to discuss disk preparation and
partitioning.  Additionally, we discuss from the perspective of existing
configurations.  I planned to write this back in 2022, after initially
switching from NixOS to Guix.  I hesitated at the time since such a post would
not have any additional value to people otherwise installing Guix.  However,
going through the process again, I feel there are some comments to capture that
may be beneficial to others venturing down this path.  I will save the
discussion between NixOS and Guix for another time.  For now, let's settle on
"scheme is more better."
</p>

</div>

<p>
After having a corrupted <a href="https://www.gnu.org/software/grub">GRUB</a> kill my previous <a href="https://guix.gnu.org/">Guix System</a>, and a false sense
of urgency, I have been running, begrudgingly, <a href="https://fedoraproject.org/">Fedora Workstation</a> for the last
10 months.  However, with summer here, I am eager to return to using <a href="https://guix.gnu.org/">Guix</a> as my
primary OS.
</p>

<p>
<a href="https://fedoraproject.org/">Fedora</a> has been fine.  It seems to work for the most part.  But there just
seems to be this constant encroaching entropy causing the system to become less
and less stable.  Using <a href="https://guix.gnu.org/">Guix</a> as a package manager seemed to work fine in the
beginning, but over time, it has started showing some degradation that is
simply unworkable.  If I must scorch earth reinstall, I might as well install
using my preferred OS and existing <a href="https://git.sr.ht/~kennyballou/dotfiles.git">system configuration</a>.  However, in my
attempts to switch back to <a href="https://guix.gnu.org/">Guix</a>, I have uncovered some sharp edges, because of
course.
</p>

<div id="outline-container-org03f348e" class="outline-2">
<h2 id="org03f348e">Disk preparation steps</h2>
<div class="outline-text-2" id="text-org03f348e">
<p>
First step to any fully encrypted setup is to throw a bunch of random bits onto
the disk, the zeroth step is to check it with <code>badblocks</code>.  Next, randomize the
data on the disk to protect against easy statistical analysis.  Afterwards, we
partition the drive into two primary physical partitions.  Then, we create the
LUKS container and the LVM volumes.  Finally, we format all the different
volumes and mount them in preparation for <code>system init</code>.
</p>
</div>

<div id="outline-container-org6277368" class="outline-3">
<h3 id="org6277368">Badblocks</h3>
<div class="outline-text-3" id="text-org6277368">
<p>
Since I still needed a working machine in the meantime, I purchased a second
drive.  This way, if the installation fails for any reason&#x2014; it did&#x2014; I can
switch back to a working "machine".  But to be sure the new drive is in good
working order, I tested it with <a href="https://en.wikipedia.org/wiki/Badblocks">badblocks</a>:
</p>

<div class="org-src-container">
<pre class="src src-bash">badblocks -wsv -t 0xEF ${<span style="font-weight: bold; font-style: italic;">device</span>}
badblocks -wsv -t 0XFE ${<span style="font-weight: bold; font-style: italic;">device</span>}
</pre>
</div>

<p>
This does two read-write, read <b>DESTRUCTIVE</b>, passes on the new device, checking
for any errors.
</p>

<p>
Now for some, this is "enough" random scrubbing of the disk in preparation for
an encrypted volume.  However, I disagree.  If the entire disk is a giant
pattern of "0xFE" values, your <i>actual</i> data shines like a bright hot star for
statistical analysis of the data.
</p>
</div>
</div>

<div id="outline-container-org2dc6dfe" class="outline-3">
<h3 id="org2dc6dfe">Random "zeroing"</h3>
<div class="outline-text-3" id="text-org2dc6dfe">
<p>
The fastest (not to be confused with "best") way I have seen to randomly write
garbage to a drive is to use a plain <code>dm-crypt</code> device with a random passphrase
and write zeros to the resulting container.
</p>

<div class="org-src-container">
<pre class="src src-bash">cryptsetup open --type plain --key-file=/dev/urandom ${<span style="font-weight: bold; font-style: italic;">device</span>} wipe-me
dd <span style="font-weight: bold; font-style: italic;">if</span>=/dev/zero <span style="font-weight: bold; font-style: italic;">of</span>=/dev/mapper/wipe-me <span style="font-weight: bold; font-style: italic;">bs</span>=4096 <span style="font-weight: bold; font-style: italic;">status</span>=progress
cryptsetup close
</pre>
</div>

<p>
Also, critical for the throughput of the above command, setting the "blocksize"
via <code>bs=4096</code> dramatically improves the write speed.
</p>
</div>
</div>

<div id="outline-container-orge3ee9f0" class="outline-3">
<h3 id="orge3ee9f0">Partitioning</h3>
<div class="outline-text-3" id="text-orge3ee9f0">
<p>
Since the system uses a single device and we have a "fully encrypted" setup, we
only need <b>two</b> partitions: first for the EFI System Partition (ESP) and second
for the LUKS container.
</p>

<p>
I created this using the interactive prompts within <code>gptdisk</code>.  Creating the
first partition to be 128M at the default starting sector (2048), and the
second taking the rest of the sectors.  I denoted their partition types using
the codes <code>EF00</code>, and <code>8308</code>, respectively.  Finally, I renamed them to something
more meaningful to me: "boot" and "guix", respectively.
</p>
</div>
</div>
