blog/2025/05/installing-guix/index.html

<div id="outline-container-org394f035" class="outline-3">
<h3 id="org394f035">Creating LUKS container</h3>
<div class="outline-text-3" id="text-org394f035">
<p>
With a fully encrypted system, including <code>/boot</code>, there are some important
limitations to keep in mind.  As of this writing, <a href="https://www.gnu.org/software/grub">GRUB</a> does not support LUKS2
containers nor does it support the Argon2 key derivation function.  Both of
which are the default for recent versions of <code>cryptsetup</code>.
</p>

<blockquote>
<p>
This is tricky because <a href="https://www.gnu.org/software/grub">GRUB</a> does <a href="https://www.gnu.org/software/grub/manual/grub/grub.html#cryptomount">claims</a> to support LUKS2, however, I was unable
to get this to work.
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-bash">cryptsetup --type luks1 <span style="font-style: italic;">\</span>
           --cipher aes-xts-plain64 <span style="font-style: italic;">\</span>
           --key-size 512 <span style="font-style: italic;">\</span>
           --hash sha512 <span style="font-style: italic;">\</span>
           --iter-time 7680 <span style="font-style: italic;">\</span>
           --use-random <span style="font-style: italic;">\</span>
           --pbkdf=pbkdf2 <span style="font-style: italic;">\</span>
           --verify-passphrase <span style="font-style: italic;">\</span>
           luksFormat <span style="font-style: italic;">\</span>
           ${<span style="font-weight: bold; font-style: italic;">device_part</span>}
</pre>
</div>

<p>
There are a few important notes here: first, the container type, as mentioned,
should be LUKS1 type container; second, the PBKDF needs to be PBKDF2, otherwise
<a href="https://www.gnu.org/software/grub">GRUB</a> does not know how to unlock it; third, make sure you replace
<code>${device_part}</code> with the appropriate partition.  While the initial unlocking is
quite slow because <a href="https://www.gnu.org/software/grub">GRUB</a> does not have full access to the machine, lowering the
iteration count is not advisable for a "secure" machine.
</p>

<p>
Ensure it all works by opening the container:
</p>

<div class="org-src-container">
<pre class="src src-bash">cryptsetup open ${<span style="font-weight: bold; font-style: italic;">device_part</span>} cryptroot
</pre>
</div>

<p>
A new device should be available under the <code>/dev/mapper</code> tree.
</p>
</div>

<div id="outline-container-org68698df" class="outline-4">
<h4 id="org68698df">"Correctly" naming the cryptroot</h4>
<div class="outline-text-4" id="text-org68698df">
<p>
I do not think it may be important, but it is perhaps worth mentioning: the
name of the device should match the name used in your configuration.  Use <code>blkid</code>
to get the UUID if needed.
</p>

<div class="org-src-container">
<pre class="src src-bash">cryptroot open ${<span style="font-weight: bold; font-style: italic;">device_part</span>} <span style="font-style: italic;">\</span>
          luks-$(blkid | grep ${<span style="font-weight: bold; font-style: italic;">device_part</span>} | awk <span style="font-style: italic;">'{print $2}'</span> | sed <span style="font-style: italic;">'s/UUID=//'</span> | sed <span style="font-style: italic;">'s/\"//g'</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb3ed092" class="outline-3">
<h3 id="orgb3ed092">Creating the LVM containers</h3>
<div class="outline-text-3" id="text-orgb3ed092">
<p>
Now, we can create the LVM containers for our partitions.
</p>

<div class="org-src-container">
<pre class="src src-bash">pvcreate /dev/mapper/cryptroot
vgcreate vg0 /dev/mapper/cryptroot
lvcreate -L 1G vg0 -n root
lvcreate -L 100G vg0 -n guix
lvcreate -L 100G vg0 -n nix
lvcreate -L 32G vg0 -n var
lvcreate -L 32G vg0 -n opt
lvcreate -L 32G vg0 -n tmp
lvcreate -L 64G vg0 -n swap
lvcreate -L 1T vg0 -n home
</pre>
</div>

<p>
Since <i>everything</i> lives under <code>/gnu/</code>, the root partition really doesn't need to
be even this large (I'm currently only using 18M on the root partition).
However, <a href="https://guix.gnu.org/">Guix</a> currently warns about this during the initialization phase.  We
can safely ignore this warning since we know the store writes go to a different
partition.  As I recall, this was not a warning before, requiring the root
partition to be quite large for the initial installation.
</p>
</div>
</div>

<div id="outline-container-orgbd31885" class="outline-3">
<h3 id="orgbd31885">Formatting</h3>
<div class="outline-text-3" id="text-orgbd31885">
<p>
Now that we have all the partitions and logical volumes created, we need to
create actual "filesystems" for each.  I have been using a combination of <code>ext4</code>
and <code>xfs</code> for a while, and it seems to work well.  While you <i>may</i> be able to get
away creating the ESP as an <code>ext2</code> partition, it is probably easier and more
widely supported to format it using <code>Fat32</code>.
</p>

<blockquote>
<p>
Since version 5.15, xfs partitions default to including <code>bigtime</code>, avoiding the
<a href="https://en.wikipedia.org/wiki/Year_2038_problem">2038 problem</a>.  Check back in 2486&#x2026;
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-bash">mkfs.vfat -F 32 -n boot ${<span style="font-weight: bold; font-style: italic;">ESP</span>}
mkfs.ext4 -L root /dev/mapper/vg0-root
mkfs.ext4 -L var /dev/mapper/vg0-var
mkfs.ext4 -L opt /dev/mapper/vg0-opt
mkfs.ext4 -L tmp /dev/mapper/vg0-tmp
mkfs.xfs -L guix /dev/mapper/vg0-guix
mkfs.xfs -L nix /dev/mapper/vg0-nix
mkfs.xfs -L home /dev/mapper/vg0-home
</pre>
</div>

<p>
Do not forget to format the swap volume:
</p>

<div class="org-src-container">
<pre class="src src-bash">mkswap /dev/mapper/vg0-swap
</pre>
</div>
</div>
</div>

<div id="outline-container-orgee857e0" class="outline-3">
<h3 id="orgee857e0">Mounting</h3>
<div class="outline-text-3" id="text-orgee857e0">
<p>
The penultimate step before turning over to the initialization step is to mount
each of the partitions:
</p>

<div class="org-src-container">
<pre class="src src-bash">mount /dev/mapper/vg0-root /mnt
mkdir -p /mnt/{boot/efi,gnu,nix,opt,var,tmp,home}
mount ${<span style="font-weight: bold; font-style: italic;">ESP</span>} /mnt/boot/efi/
mount /dev/mapper/vg0-guix /mnt/gnu
mount /dev/mapper/vg0-nix /mnt/nix
mount /dev/mapper/vg0-var /mnt/var
mount /dev/mapper/vg0-opt /mnt/opt
mount /dev/mapper/vg0-tmp /mnt/tmp
mount /dev/mapper/vg0-home /mnt/home
</pre>
</div>

<p>
You can optionally enable the swap partition for the current live installation:
</p>

<div class="org-src-container">
<pre class="src src-bash">swapon /dev/mapper/vg0-swap
</pre>
</div>
</div>

<div id="outline-container-orgb14e20e" class="outline-4">
<h4 id="orgb14e20e">Nix Store</h4>
<div class="outline-text-4" id="text-orgb14e20e">
<p>
If you choose to run <code>nix</code> as an addition package manager, make sure to create
the "store" directory, lest your first boot waits forever for such a directory
to appear&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-bash">mkdir -p /mnt/nix/store
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org231991a" class="outline-2">
<h2 id="org231991a">Cloning and modifying UUIDs</h2>
<div class="outline-text-2" id="text-org231991a">
<p>
Each configuration is different, but before initializing the system, I need to
change the UUIDs of the initial LUKS volumes within my system configuration.
Some people have clever ways of scripting this out.  I accept this tiny amount
of pain now which grants me the peace of mind I do not need to worry about it
some how changing and becoming unbootable later.  I simply use <code>blkid</code> to get the
UUID of the <code>${device_part}</code> and update the system config accordingly:
</p>

<div class="org-src-container">
<pre class="src src-diff">modified   systems/axo.scm
<span style="font-weight: bold;">@@ -59,8 +59,8 @@</span>
 
     (mapped-devices
      (list (mapped-device
-            (source (uuid "f1e8d842-1c63-4311-803d-938f31d48d49"))
-            (target "luks-f1e8d842-1c63-4311-803d-938f31d48d49")
+            (source (uuid "d1bcf4fd-8fe8-41b6-88dc-c83851b1f071"))
+            (target "luks-d1bcf4fd-8fe8-41b6-88dc-c83851b1f071")
             (type luks-device-mapping))
            (mapped-device
             (source "vg0")
<span style="font-weight: bold;">@@ -117,7 +118,7 @@</span>
                     (needed-for-boot? #t)
                     (dependencies mapped-devices)))
             (efi (file-system
-                   (device (uuid "5A5D-20AF" 'fat))
+                   (device (uuid "0601-7942" 'fat))
                    (mount-point "/boot/efi")
                    (type "vfat")
                    (dependencies mapped-devices))))
</pre>
</div>
</div>
</div>
