blog/2025/05/installing-guix/index.org
** System initialization
:PROPERTIES:
:ID:       2a65ccbb-7257-42bb-b201-e5882589e3ae
:END:

Before starting the initialization process, start the copy-on-write service to
ensure any changes made to the running [[guix][Guix]] system (e.g., live installation
media) are copied to the new system's store.

#+begin_src bash :eval never
herd start cow-store /mnt
#+end_src

Now, we can move to initializing the system.

#+begin_quote
It's critical for this step that your system has network connectivity.  Test by
pinging CloudFlare: ~ping 1.1.1.1~.
#+end_quote

From the root of the [[dotfiles]] repository, run the following command:

#+begin_src bash :eval never
guix time-machine -C ./config/guix/channels.scm -- system init \
     -L ./ \
     systems/${machine}.scm \
     /mnt
#+end_src

Assuming everything works, we should be able to reboot into the new system.

** After initialization steps
:PROPERTIES:
:ID:       a22533df-a46e-4fab-836a-bf0cc1834a33
:END:

After successfully booting into the freshly initialized system, we need to set
the passwords of the root and default user.

Switch over to a different ~tty~ and "login" as root, and set the passwords using
~passwd~.

** Parting thoughts
:PROPERTIES:
:ID:       17d3d45b-8203-4252-b6fc-48b3aff7858a
:END:

Because installing my typical configuration is a little heavy, I am considering
creating a smaller configuration just for the initial installation to quickly
get into the new system.  From there, re-configuring to the final system is a
lot easier (and safer) than the installation media.
