blog/2025/05/installing-guix/index.html

<div id="outline-container-org1cefb82" class="outline-2">
<h2 id="org1cefb82">System initialization</h2>
<div class="outline-text-2" id="text-org1cefb82">
<p>
Before starting the initialization process, start the copy-on-write service to
ensure any changes made to the running <a href="https://guix.gnu.org/">Guix</a> system (e.g., live installation
media) are copied to the new system's store.
</p>

<div class="org-src-container">
<pre class="src src-bash">herd start cow-store /mnt
</pre>
</div>

<p>
Now, we can move to initializing the system.
</p>

<blockquote>
<p>
It's critical for this step that your system has network connectivity.  Test by
pinging CloudFlare: <code>ping 1.1.1.1</code>.
</p>
</blockquote>

<p>
From the root of the <a href="https://git.sr.ht/~kennyballou/dotfiles.git">https://git.sr.ht/~kennyballou/dotfiles.git</a> repository, run the following command:
</p>

<div class="org-src-container">
<pre class="src src-bash">guix time-machine -C ./config/guix/channels.scm -- system init <span style="font-style: italic;">\</span>
     -L ./ <span style="font-style: italic;">\</span>
     systems/${<span style="font-weight: bold; font-style: italic;">machine</span>}.scm <span style="font-style: italic;">\</span>
     /mnt
</pre>
</div>

<p>
Assuming everything works, we should be able to reboot into the new system.
</p>
</div>
</div>

<div id="outline-container-org1561ee7" class="outline-2">
<h2 id="org1561ee7">After initialization steps</h2>
<div class="outline-text-2" id="text-org1561ee7">
<p>
After successfully booting into the freshly initialized system, we need to set
the passwords of the root and default user.
</p>

<p>
Switch over to a different <code>tty</code> and "login" as root, and set the passwords using
<code>passwd</code>.
</p>
</div>
</div>

<div id="outline-container-orgcfe4a82" class="outline-2">
<h2 id="orgcfe4a82">Parting thoughts</h2>
<div class="outline-text-2" id="text-orgcfe4a82">
<p>
Because installing my typical configuration is a little heavy, I am considering
creating a smaller configuration just for the initial installation to quickly
get into the new system.  From there, re-configuring to the final system is a
lot easier (and safer) than the installation media.
</p>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2025 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
